snlkuharlocal/src/Documents/ПередачаКонтрагента/ПередачаКонтрагента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПередачаКонтрагента</name>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонтрагентИнт</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>УзелДляДобавления</name>
    <attributes>
      <name>КодУзла</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>3</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УзелДляУдаления</name>
    <attributes>
      <name>КодУзла</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>3</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Взаиморасчеты</name>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.Договоры</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаУпр</name>
      <comment>Сумма в валюте упр. учета</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КонтрагентИнт</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументЗакрытогоПериода</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачалаЗадолженности</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДокументСсылка</name>
      <type>
        <types>DocumentRef.РеформацияБаланса</types>
        <types>DocumentRef.РасходныйКассовыйОрдер</types>
        <types>DocumentRef.ВводОстатковВзаиморасчетов</types>
        <types>DocumentRef.ОтчетКассовойСмены</types>
        <types>DocumentRef.КорректировкаЗадолженности</types>
        <types>DocumentRef.Взаимозачет</types>
        <types>DocumentRef.ПриходныйКассовыйОрдер</types>
        <types>DocumentRef.ПродажаИМ</types>
        <types>DocumentRef.АвансовыйОтчет</types>
        <types>DocumentRef.ПриходнаяНакладная</types>
        <types>DocumentRef.ЗаказПоставщику</types>
        <types>DocumentRef.СписаниеТМЦСпути</types>
        <types>DocumentRef.Инвентаризация</types>
        <types>DocumentRef.ДвиженияДенежныхСредств</types>
        <types>DocumentRef.РекламационнаяНакладная</types>
        <types>DocumentRef.РасходнаяНакладная</types>
        <types>DocumentRef.Претензия</types>
        <types>DocumentRef.УслугиСтороннихОрганизаций</types>
        <types>DocumentRef.СписаниеКурсовыхРазниц</types>
        <types>DocumentRef.Машина</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/InformationRegisters/ЦеныНоменклатуры/ЦеныНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныНоменклатуры</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Брэнд</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипТовара</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Модель</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>УровеньДоступа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ТипЦен</name>
    <type>
      <types>CatalogRef.ТипыЦен</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Прайс</name>
    <type>
      <types>DocumentRef.ПрайсЛист</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/AccumulationRegisters/Взаиморасчеты/Взаиморасчеты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Взаиморасчеты</name>
  <resources>
    <name>СуммаВал</name>
    <comment>Сумма в рублях</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаУпр</name>
    <comment>Сумма в валюте расчетов</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>КодОперации</name>
    <type>
      <types>EnumRef.КодыОперацийОстатки</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДДС</name>
    <type>
      <types>CatalogRef.СтатьиЗатрат</types>
    </type>
  </attributes>
  <attributes>
    <name>Дата_НачалаЗадолженности</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Документ_ЗакрытогоПериода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УИД_СтрокиПлатежа</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

snlkuharlocal/src/Documents/ВводОстатковВзаиморасчетов/ВводОстатковВзаиморасчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВводОстатковВзаиморасчетов</name>
  <registerRecords>AccumulationRegister.ВзаиморасчетыПоДокументамРасчетов</registerRecords>
  <registerRecords>AccumulationRegister.Взаиморасчеты</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ИБ</name>
    <type>
      <types>CatalogRef.ИБ</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВводОстатков</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Взаиморасчеты</name>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.Договоры</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаВал</name>
      <comment>Сумма в валюте договора</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаУпр</name>
      <comment>Сумма в валюте упр. учета</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачалаЗадолженности</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДокументЗакрытогоПериода</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/Documents/ПрайсЛист/ПрайсЛист.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПрайсЛист</name>
  <basedOn>Document.ЗаявкаНаУстановкуЦен</basedOn>
  <attributes>
    <name>ИБ</name>
    <type>
      <types>CatalogRef.ИБ</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЦен</name>
    <type>
      <types>CatalogRef.ТипыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГруппыТоваров</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Дата2</name>
    <comment>Дата окончания действия прайса</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УровеньДоступа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Акция</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокОснование</name>
    <type>
      <types>DocumentRef.ЗаявкаНаУстановкуЦен</types>
      <types>DocumentRef.РасчетЦен</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Брэнд</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/Documents/ПередачаКонтрагента/ObjectModule.bsl
Процедура ПриЗаписи(Отказ)
	//Катаев+ 20/01/14 Переработан принцип регистрации документов и справочников исходя из того что Контрагент может быть группой
	//Если ПланыОбмена.Основной.ЭтотУзел().Код = "SNL" Тогда
	//	//Катаев+ 15/11/13
	//	ТипЦенК = Контрагент.ТипЦен;
	//	ЗапросПрайс = Новый Запрос;
	//	ЗапросПрайс.Текст =
	//	"ВЫБРАТЬ
	//	|	ПрайсЛист.Ссылка
	//	|ИЗ
	//	|	Документ.ПрайсЛист КАК ПрайсЛист
	//	|ГДЕ
	//	|	ПрайсЛист.ТипЦен = &ТипЦен
	//	|	И ПрайсЛист.Дата2 >= &ТекущаяДата";
	//	ЗапросПрайс.УстановитьПараметр("ТипЦен", ТипЦенК);
	//	ЗапросПрайс.УстановитьПараметр("ТекущаяДата", НачалоДня(ТекущаяДата()));
	//	ВыборкаПрайс = ЗапросПрайс.Выполнить().Выбрать();
	//	ЗапросМатрица = Новый Запрос;
	//	ЗапросМатрица.Текст =
	//	"ВЫБРАТЬ
	//	|	Матрица.Ссылка
	//	|ИЗ
	//	|	Документ.Матрица КАК Матрица
	//	|ГДЕ
	//	|	Матрица.ДатаОкончания >= &ТекущаяДата
	//	|	И Матрица.Контрагент = &Контрагент";
	//	ЗапросМатрица.УстановитьПараметр("ТекущаяДата", НачалоДня(ТекущаяДата()));
	//	ЗапросМатрица.УстановитьПараметр("Контрагент", Контрагент);
	//	ВыборкаМатрица = ЗапросМатрица.Выполнить().Выбрать();
	//	//Катаев- 15/11/13
	//	//Выборка документов по контрагенту для регистрации в узле
	//	Запрос = Новый запрос;
	//	Запрос.Текст =
	//	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	//	|	Взаиморасчеты.Регистратор
	//	|ИЗ
	//	|	РегистрНакопления.Взаиморасчеты КАК Взаиморасчеты
	//	|ГДЕ
	//	|	Взаиморасчеты.Период >= &Дата
	//	|	И Взаиморасчеты.Контрагент = &Контрагент
	//	|
	//	|УПОРЯДОЧИТЬ ПО
	//	|	Взаиморасчеты.Период";
	//	Запрос.УстановитьПараметр("Контрагент", КонтрагентИнт);
	//	Запрос.УстановитьПараметр("Дата", ДатаНачала);
	//	Выборка = Запрос.Выполнить().Выбрать();
	//	Для Каждого узел из УзелДляДобавления Цикл
	//		УзелОбмена = ПланыОбмена.Основной.НайтиПоКоду(Узел.КодУзла);
	//		//Попытка
	//			спр = Контрагент.ПолучитьОбъект();
	//			ДобавитьУзлы(спр, УзелДляДобавления);
	//			спр.Записать();
	//			Если ПолучитьПолномочиеПользователя("РедактированиеИнтегральныхКонтрагентов", ПараметрыСеанса.Пользователь) и Не КонтрагентИнт.Пустая() Тогда
	//				спр = КонтрагентИнт.ПолучитьОбъект();
	//				ДобавитьУзлы(спр, УзелДляДобавления);
	//			Иначе
	//				редИнт = Ложь;
	//			КонецЕсли;
	//			Пока Выборка.Следующий() Цикл
	//				ПланыОбмена.ЗарегистрироватьИзменения(УзелОбмена, Выборка.Регистратор);
	//			КонецЦикла;
	//			ПланыОбмена.ЗарегистрироватьИзменения(УзелОбмена, ЭтотОбъект.Ссылка);
	//		//Исключение
	//		//КонецПопытки;
	//		//Катаев+ 15/11/13
	//		//- прайс-листов по типу цен (в карточке контрагента на закладке «Значения по умолчанию») + добавление этого типа цен в узел обмена подразделения выгрузки;
	//		Если Не ТипЦенК.Пустая() Тогда
	//			Пока ВыборкаПрайс.Следующий() Цикл
	//				Объект = ВыборкаПрайс.Ссылка.ПолучитьОбъект();
	//				Если Объект.Дата <= Константы.ДатаЗапретаРедактирования.Получить() Тогда
	//					Объект.Дата = Константы.ДатаЗапретаРедактирования.Получить()+86400;
	//				КонецЕсли;
	//				ПланыОбмена.ЗарегистрироватьИзменения(УзелОбмена, Объект);
	//			КонецЦикла;
	//			тз = УзелОбмена.ТипыЦен.Выгрузить();
	//			Если тз.Найти(ТипЦенК, "ТипЦен") = Неопределено Тогда
	//				стр = тз.Добавить();
	//				стр.ТипЦен = ТипЦенК;
	//				ОбъектУзла = УзелОбмена.ПолучитьОбъект();
	//				ОбъектУзла.ТипыЦен.Загрузить(тз);
	//				ОбъектУзла.Записать();
	//			КонецЕсли;
	//			//Катаев+ 04/12/13 Регистрируем тип цен в узле
	//			ПланыОбмена.ЗарегистрироватьИзменения(УзелОбмена, Контрагент.ТипЦен);
	//			//Катаев- 04/12/13
	//		КонецЕсли;
	//		//- док. матриц на этого контрагента;
	//		Пока ВыборкаМатрица.Следующий() Цикл
	//			Объект = ВыборкаМатрица.Ссылка.ПолучитьОбъект();
	//			//Катаев+ 04/12/13
	//			//Если Объект.Дата <= Константы.ДатаЗапретаРедактирования.Получить() Тогда
	//			//	Объект.Дата = Константы.ДатаЗапретаРедактирования.Получить()+86400;
	//			//КонецЕсли;
	//			тзПодр = Объект.Подразделения.Выгрузить();
	//			Если тзПодр.Найти(УзелОбмена,"Подразделение") = Неопределено Тогда
	//				стр = тзПодр.Добавить();
	//				стр.Подразделение = УзелОбмена;
	//				Объект.Подразделения.Загрузить(тзПодр);
	//				Объект.Записать();
	//			КонецЕсли;
	//			//Катаев- 04/12/13
	//			ПланыОбмена.ЗарегистрироватьИзменения(УзелОбмена, Объект);
	//		КонецЦикла;
	//		//- спр. артикулы контрагентов по типу артикула контрагента, указанного в карточке клиента на закладке «Настройка печати документов»
	//		Если Не Контрагент.ТипАртикула.Пустая() Тогда
	//			ПланыОбмена.ЗарегистрироватьИзменения(УзелОбмена, Контрагент.ТипАртикула);
	//		КонецЕсли;
	//		//- спр. штрих коды контрагентов, указанного в карточке клиента на закладке «Настройка печати документов»
	//		Если Не Контрагент.ШтрихКодыКонтрагента.Пустая() Тогда
	//			ПланыОбмена.ЗарегистрироватьИзменения(УзелОбмена, Контрагент.ШтрихКодыКонтрагента);
	//		КонецЕсли;
	//		
	//		//Катаев- 15/11/13
	//	КонецЦикла;
	//	
	//	// Регистрируем контрагента в узлах для удаления
	//	спр = Контрагент.ПолучитьОбъект();
	//	УдалитьУзлы(спр, УзелДляУдаления);
	//	спр.Записать();
	//	редИнт = Истина;
	//	Если ПолучитьПолномочиеПользователя("РедактированиеИнтегральныхКонтрагентов", ПараметрыСеанса.Пользователь) и Не КонтрагентИнт.Пустая() Тогда
	//		спр = КонтрагентИнт.ПолучитьОбъект();
	//		УдалитьУзлы(спр, УзелДляУдаления);
	//	Иначе
	//		Если Не КонтрагентИнт.Пустая() Тогда
	//			редИнт = Ложь;
	//		КонецЕсли;
	//	КонецЕсли;
	//	Если Не редИнт Тогда
	//		Сообщить("Отсутствует разрещение за запись интегрального контаргента. Редактирование не произведено. Обратитесь в ТП")
	//	КонецЕсли;
	//Иначе //Катаев+ 04/12/13 Перенес код из процедуры по проведению документа
	//	СоздатьДокумент = Ложь;
	//	Запрос = Новый Запрос;
	//	Запрос.Текст =
	//	"ВЫБРАТЬ
	//	|	ВзаиморасчетыОстатки.Договор,
	//	|	ВзаиморасчетыОстатки.СуммаУпрОстаток КАК СуммаУпрФилиал
	//	|ИЗ
	//	|	РегистрНакопления.Взаиморасчеты.Остатки(&Дата, Контрагент = &Контрагент) КАК ВзаиморасчетыОстатки";
	//	Запрос.УстановитьПараметр("Дата", ДатаНачала+1);
	//	Запрос.УстановитьПараметр("Контрагент", КонтрагентИнт);
	//	тз = Взаиморасчеты.Выгрузить();
	//	тз1 = Запрос.Выполнить().Выгрузить();
	//	тз1.Колонки.Добавить("СуммаУпр");
	//	тз1.Колонки.Добавить("Разница");
	//	Отбор = Новый Структура;
	//	Для Каждого стр из тз Цикл
	//		Отбор.Вставить("Договор", стр.Договор);
	//		НайденнаяСтрока = тз1.НайтиСтроки(Отбор);
	//		Если НайденнаяСтрока.Количество() = 1 Тогда
	//			НайденнаяСтрока[0].СуммаУпр = стр.СуммаУпр;
	//		Иначе
	//			новСтр = тз1.Добавить();
	//			новСтр.СуммаУпр = стр.СуммаУпр;
	//			новСтр.Договор = стр.Договор;
	//		КонецЕсли;
	//	КонецЦикла;
	//	Для каждого стр из тз1 Цикл
	//		Если стр.СуммаУпр = Неопределено Тогда
	//			стр.СуммаУпр = 0;
	//		КонецЕсли;
	//		Если стр.СуммаУпрФилиал = Неопределено Тогда
	//			стр.СуммаУпрФилиал = 0;
	//		КонецЕсли;
	//		стр.Разница = стр.СуммаУпр - стр.СуммаУпрФилиал;
	//		Если стр.Разница <> 0 Тогда
	//			СоздатьДокумент = Истина;
	//		КонецЕсли;
	//	КонецЦикла;
	//	
	//	Если СоздатьДокумент Тогда
	//		Док = Документы.ВводОстатковВзаиморасчетов.СоздатьДокумент();
	//		Док.Дата = ДатаНачала;
	//		Док.Автор =  ПараметрыСеанса.Пользователь;
	//		Док.Комментарий = "Корректировка остатков взаиморасчетов";
	//		Док.Организация = Справочники.Организации.НайтиПоКоду("SS-001");
	//		Док.ВводОстатков = Ложь;
	//		Док.ИБ = Справочники.ИБ.НайтиПоКоду("SMN");
	//		Для каждого стр из тз1 Цикл
	//			Если стр.Разница <> 0 Тогда
	//				стрВ = Док.Взаиморасчеты.Добавить();
	//				стрВ.Договор = стр.Договор;
	//				стрВ.Контрагент = КонтрагентИнт;
	//				стрВ.СуммаВал = стр.Разница;
	//				стрВ.СуммаУпр = стр.Разница;
	//			КонецЕсли;
	//		КонецЦикла;
	//		Док.Записать(РежимЗаписиДокумента.Проведение);
	//	КонецЕсли;
	//КонецЕсли;
	//Катаев- 20/01/14
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)Экспорт
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки
	Если ПланыОбмена.Основной.ЭтотУзел().Код = "SNL" Тогда
		сзКонтрагенты = ПолучитьКонтрагентов(Контрагент);
		Если КонтрагентИнт.Пустая() Тогда
			сзКонтрагентыИнт = ПолучитьИнтКонтрагентов(Контрагент);
		Иначе
			сзКонтрагентыИнт = ПолучитьКонтрагентов(КонтрагентИнт);
		КонецЕсли;
		ТипЦен = ПолучитьТипы(сзКонтрагенты);
		ЗарегистрироватьКонтрагентов(сзКонтрагенты, сзКонтрагентыИнт, Отказ);
		Если Не Отказ Тогда
			сзПрайс = ПолучитьПрайсы(ТипЦен);
			сзМатрицы = ПолучитьМатрицы(сзКонтрагенты);
			сзАртикулы = ПолучитьАртикулы(сзКонтрагенты);
			сзШК = ПолучитьШК(сзКонтрагенты);
			//Регистрация Матрицы
			Для Каждого стр из сзМатрицы Цикл
				Объект = стр.Значение.ПолучитьОбъект();
				тзПодр = Объект.Подразделения.Выгрузить();
				ДанныеИзменены = Ложь;
				Для Каждого узел из УзелДляДобавления Цикл
					УзелОбмена = ПланыОбмена.Основной.НайтиПоКоду(Узел.КодУзла);
					Если тзПодр.Найти(УзелОбмена,"Подразделение") = Неопределено Тогда
						стр = тзПодр.Добавить();
						стр.Подразделение = УзелОбмена;
						ДанныеИзменены = Истина;
					КонецЕсли;
				КонецЦикла;
				Если ДанныеИзменены Тогда
					Объект.Подразделения.Загрузить(тзПодр);
					Объект.Записать();
				КонецЕсли;
			КонецЦикла;
			Для Каждого узел из УзелДляДобавления Цикл
				УзелОбмена = ПланыОбмена.Основной.НайтиПоКоду(Узел.КодУзла);
				//Регистрация Прайса
				Для Каждого стр из сзПрайс Цикл
					ПланыОбмена.ЗарегистрироватьИзменения(УзелОбмена, стр.Значение);
					//Катаев+ 23/04/14 Регистрируем еще и регистр сведений по прайсу
					Набор=РегистрыСведений.ЦеныНоменклатуры.СоздатьНаборЗаписей();
					Набор.Отбор.Прайс.Установить(стр.Значение);
					Набор.Прочитать();
					тзНабор = Набор.Выгрузить();
					Для Каждого Запись Из тзНабор Цикл
						Набор.Отбор.Прайс.установить(Запись.Прайс);
						Набор.Отбор.Прайс.Использование=Истина;
						Набор.Отбор.ТипЦен.установить(Запись.ТипЦен);
						Набор.Отбор.ТипЦен.Использование=Истина;
						Набор.Отбор.Номенклатура.установить(Запись.Номенклатура);
						Набор.Отбор.Номенклатура.Использование=Истина;
						Набор.Отбор.Период.Установить(Запись.Период);
						Набор.Отбор.Период.Использование=Истина;
						Набор.Прочитать();
						Набор.ОбменДанными.Получатели.Добавить(УзелОбмена);			  
						ПланыОбмена.ЗарегистрироватьИзменения(УзелОбмена, Набор);
					КонецЦикла;	
					//Катаев- 23/04/14
				КонецЦикла;
				//Регистрация Артикула
				Для Каждого стр из сзАртикулы Цикл
					ПланыОбмена.ЗарегистрироватьИзменения(УзелОбмена, стр.Значение);
				КонецЦикла;
				//Регистрация ШК
				Для Каждого стр из сзШК Цикл
					ПланыОбмена.ЗарегистрироватьИзменения(УзелОбмена, стр.Значение);
				КонецЦикла;
				//Регистрация Типа цен
				тз = УзелОбмена.ТипыЦен.Выгрузить();
				ОбъектУзла = УзелОбмена.ПолучитьОбъект();
				ДанныеИзменены = Ложь;
				Для Каждого стр из ТипЦен Цикл
					ПланыОбмена.ЗарегистрироватьИзменения(УзелОбмена, стр.Значение);
					Если тз.Найти(стр.Значение, "ТипЦен") = Неопределено Тогда
						стрТипЦен = тз.Добавить();
						стрТипЦен.ТипЦен = стр.Значение;
						ДанныеИзменены = Истина;
					КонецЕсли;
				КонецЦикла;
				Если ДанныеИзменены Тогда
					ОбъектУзла.ТипыЦен.Загрузить(тз);
					ОбъектУзла.Записать();
				КонецЕсли;
				//катаев+ 31/12/14 Добавил регистрацию этого файла в узле
				ПланыОбмена.ЗарегистрироватьИзменения(УзелОбмена, ЭтотОбъект.Ссылка);
				//Катаев- 31/12/13
			КонецЦикла;
			ЗарегистрироватьВзаиморасчеты(сзКонтрагентыИнт);
		КонецЕсли;
	Иначе
		СоздатьДокумент = Ложь;
		Запрос = Новый Запрос;
		//Катаев+ 25/08/14
		//Запрос.Текст =
		//"ВЫБРАТЬ
		//|	ВзаиморасчетыОстатки.Договор,
		//|	ВзаиморасчетыОстатки.СуммаУпрОстаток КАК СуммаУпрФилиал,
		//|	ВзаиморасчетыОстатки.Контрагент
		//|ИЗ
		//|	РегистрНакопления.Взаиморасчеты.Остатки(&Дата, Контрагент В ИЕРАРХИИ (&Контрагент)) КАК ВзаиморасчетыОстатки";
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ВзаиморасчетыОстатки.Договор,
		|	ВзаиморасчетыОстатки.СуммаУпрОстаток КАК СуммаУпрФилиал,
		|	ВзаиморасчетыОстатки.Контрагент
		|ИЗ
		|	РегистрНакопления.Взаиморасчеты.Остатки(
		|			&Дата,
		|			Контрагент В ИЕРАРХИИ (&Контрагент)
		//крохин начало 11.09.2018
		//измерения удалены
		//|				И ДокументЗакрытогоПериода = """"
		//крохин конец 11.09.2018
		|) КАК ВзаиморасчетыОстатки";
		//Катаев- 25/08/14
		//Катаев+ 29/07/14
		//Запрос.УстановитьПараметр("Дата", ДатаНачала+1);
		//Катаев+ 20/08/14
		//Запрос.УстановитьПараметр("Дата", Новый Граница(ДатаНачала, ВидГраницы.Исключая)); //Катаев+ 08/08/14 Исправил вид границы.
		Запрос.УстановитьПараметр("Дата", Новый Граница(КонецДня(ДатаНачала), ВидГраницы.Включая));
		//Катаев- 20/08/14
		//Катаев- 29/07/14
		Запрос.УстановитьПараметр("Контрагент", КонтрагентИнт);
		//Катаев+ 20/08/14 Во взаиморасчетах тепреь присутствуют как остатки, так и документы из закрытого периода. Делаем разбивку на две ТЗ
		//тз = Взаиморасчеты.Выгрузить();
		тз = Новый ТаблицаЗначений;
		тзДок = Новый ТаблицаЗначений;
		тз.Колонки.Добавить("КонтрагентИнт");
		тз.Колонки.Добавить("Договор");
		тз.Колонки.Добавить("СуммаУпр");
		тзДок.Колонки.Добавить("КонтрагентИнт");
		тзДок.Колонки.Добавить("Договор");
		тзДок.Колонки.Добавить("СуммаУпр");
		тзДок.Колонки.Добавить("ДокументЗакрытогоПериода");
		тзДок.Колонки.Добавить("ДатаНачалаЗадолженности");
		тзДок.Колонки.Добавить("ДокументСсылка");
		Для Каждого стр из Взаиморасчеты Цикл
			Если ПустаяСтрока(стр.ДокументЗакрытогоПериода) Тогда
				НоваяСтрока = тз.Добавить();
				НоваяСтрока.КонтрагентИнт = стр.КонтрагентИнт;
				НоваяСтрока.Договор = стр.Договор;
				НоваяСтрока.СуммаУпр = стр.СуммаУпр;
			Иначе
				//крохин начало 11.09.2018
				//измерение "документ закрытого периода" удалено
				//Если Лев(стр.ДокументСсылка,18) = "<Объект не найден>" Тогда
				//	//Катаев+ 25/08/14 Проверяем есть ли уже такой документ закрытого периода
				//	Запрос1 = Новый Запрос;
				//	Запрос1.Текст =
				//	"ВЫБРАТЬ
				//	|	Взаиморасчеты.ДокументЗакрытогоПериода
				//	|ИЗ
				//	|	РегистрНакопления.Взаиморасчеты КАК Взаиморасчеты
				//	|ГДЕ
				//	|	Взаиморасчеты.ДокументЗакрытогоПериода = &ДокументЗакрытогоПериода";
				//	Запрос1.УстановитьПараметр("ДокументЗакрытогоПериода", стр.ДокументЗакрытогоПериода);
				//	Если Запрос1.Выполнить().Выбрать().Следующий() Тогда
				//		Продолжить;
				//	КонецЕсли;
				//	СоздатьДокумент = Истина;
				//	//Катаев- 25/08/14
				//	НоваяСтрока = тзДок.Добавить();
				//	НоваяСтрока.КонтрагентИнт = стр.КонтрагентИнт;
				//	НоваяСтрока.Договор = стр.Договор;
				//	НоваяСтрока.СуммаУпр = стр.СуммаУпр;
				//	НоваяСтрока.ДокументЗакрытогоПериода = стр.ДокументЗакрытогоПериода;
				//	//крохин начало\
				//	
				//	НоваяСтрока.ДатаНачалаЗадолженности = стр.ДатаНачалаЗадолженности;
				//	НоваяСтрока.ДокументСсылка = стр.ДокументСсылка;
				//Иначе
				//	//Катаев+ 27/08/14
				//	Запрос1 = Новый Запрос;
				//	Запрос1.Текст =
				//	"ВЫБРАТЬ
				//	|	Взаиморасчеты.СуммаУпр
				//	|ИЗ
				//	|	РегистрНакопления.Взаиморасчеты КАК Взаиморасчеты
				//	|ГДЕ
				//	|	Взаиморасчеты.Контрагент = &Контрагент
				//	|	И Взаиморасчеты.Договор = &Договор
				//	|	И (Взаиморасчеты.Регистратор = &Регистратор
				//	|			ИЛИ Взаиморасчеты.ДокументЗакрытогоПериода = &ДокументЗакрытогоПериода)";
				//	Запрос1.УстановитьПараметр("Контрагент", стр.КонтрагентИнт);
				//	Запрос1.УстановитьПараметр("Договор", стр.Договор);
				//	Запрос1.УстановитьПараметр("Регистратор", стр.ДокументСсылка);
				//	Запрос1.УстановитьПараметр("ДокументЗакрытогоПериода", стр.ДокументЗакрытогоПериода);
				//	Если Не Запрос1.Выполнить().Выбрать().Следующий() Тогда
				//		СоздатьДокумент = Истина;
				//		НоваяСтрока = тзДок.Добавить();
				//		НоваяСтрока.КонтрагентИнт = стр.КонтрагентИнт;
				//		НоваяСтрока.Договор = стр.Договор;
				//		НоваяСтрока.СуммаУпр = стр.СуммаУпр;
				//		НоваяСтрока.ДокументЗакрытогоПериода = стр.ДокументЗакрытогоПериода;
				//		НоваяСтрока.ДатаНачалаЗадолженности = стр.ДатаНачалаЗадолженности;
				//	КонецЕсли;
				//	//Катаев- 27/08/14
				//КонецЕсли;
				//крохин конец 11.09.2018
			КонецЕсли;
		КонецЦикла;
		//Катаев- 20/08/14
		тз1 = Запрос.Выполнить().Выгрузить();
		тз1.Колонки.Добавить("СуммаУпр");
		тз1.Колонки.Добавить("Разница");
		Отбор = Новый Структура;
		Для Каждого стр из тз Цикл
			Отбор.Вставить("Договор", стр.Договор);
			НайденнаяСтрока = тз1.НайтиСтроки(Отбор);
			Если НайденнаяСтрока.Количество() = 1 Тогда
				НайденнаяСтрока[0].СуммаУпр = стр.СуммаУпр;
			Иначе
				новСтр = тз1.Добавить();
				//Катаев+ 27/08/14
				новСтр.Контрагент = стр.КонтрагентИнт;
				//Катаев- 27/08/14
				новСтр.СуммаУпр = стр.СуммаУпр;
				новСтр.Договор = стр.Договор;
			КонецЕсли;
		КонецЦикла;
		Для каждого стр из тз1 Цикл
			Если стр.СуммаУпр = Неопределено Тогда
				стр.СуммаУпр = 0;
			КонецЕсли;
			Если стр.СуммаУпрФилиал = Неопределено Тогда
				стр.СуммаУпрФилиал = 0;
			КонецЕсли;
			стр.Разница = стр.СуммаУпр - стр.СуммаУпрФилиал;
			Если стр.Разница <> 0 Тогда
				СоздатьДокумент = Истина;
			КонецЕсли;
		КонецЦикла;
		
		Если СоздатьДокумент Тогда
			Док = Документы.ВводОстатковВзаиморасчетов.СоздатьДокумент();
			//Катаев+ 20/08/14
			//Док.Дата = ДатаНачала-1;
			Док.Дата = КонецДня(ДатаНачала);
			//Катаев- 20/08/14
			Док.Автор =  ПараметрыСеанса.Пользователь;
			Док.Комментарий = "Корректировка остатков взаиморасчетов";
			Док.Организация = Справочники.Организации.НайтиПоКоду("SS-001");
			Док.ВводОстатков = Ложь;
			Док.ИБ = Справочники.ИБ.НайтиПоКоду("SMN");
			Для каждого стр из тз1 Цикл
				Если стр.Разница <> 0 Тогда
					стрВ = Док.Взаиморасчеты.Добавить();
					стрВ.Договор = стр.Договор;
					стрВ.Контрагент = стр.Контрагент;
					стрВ.СуммаВал = стр.Разница;
					стрВ.СуммаУпр = стр.Разница;
				КонецЕсли;
			КонецЦикла;
			//Катаев+ 20/08/14 Добавляем документы из закрытого периода
			Для Каждого стр из тзДок Цикл
				стрВ = Док.Взаиморасчеты.Добавить();
				стрВ.Договор = стр.Договор;
				//Катаев+ 25/08/14
				//стрВ.Контрагент = стр.Контрагент;
				стрВ.Контрагент = стр.КонтрагентИнт;
				стрВ.СуммаУпр = стр.СуммаУпр;
				стрВ.СуммаВал = стр.СуммаУпр;
				//Катаев- 25/08/14
				//крохин начало 11.09.2018
				//измерения удалены
				//стрВ.ДатаНачалаЗадолженности = стр.ДатаНачалаЗадолженности;
				//стрВ.ДокументЗакрытогоПериода = стр.ДокументЗакрытогоПериода;
				//крохин конец 11.09.2018
			КонецЦикла;
			//Катаев- 20/08/14
			Док.ЗаписатьБезПроверки(РежимЗаписиДокумента.Проведение);
		КонецЕсли;
	КонецЕсли;
	//Катаев- 20/01/14
КонецПроцедуры

//Катаев+ 20/01/14 Новые функции и процедуры
Процедура ЗарегистрироватьВзаиморасчеты(КонтрагентИнт)
	Запрос = Новый запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Взаиморасчеты.Регистратор
	//крохин начало 08.07.2019
	|   ,Взаиморасчеты.Период
	//крохин конец 08.07.2019
	|ИЗ
	|	РегистрНакопления.Взаиморасчеты КАК Взаиморасчеты
	|ГДЕ
	|	Взаиморасчеты.Период >= &Дата
	|	И Взаиморасчеты.Контрагент В ИЕРАРХИИ(&Контрагент)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Взаиморасчеты.Период";
	Запрос.УстановитьПараметр("Контрагент", КонтрагентИнт);
	//Катаев+ 20/08/14
	//Запрос.УстановитьПараметр("Дата", ДатаНачала);
	Запрос.УстановитьПараметр("Дата", НачалоМесяца(ТекущаяДата()));
	//Катаев- 20/08/14
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Для Каждого узел из УзелДляДобавления Цикл
			УзелОбмена = ПланыОбмена.Основной.НайтиПоКоду(Узел.КодУзла);
			ПланыОбмена.ЗарегистрироватьИзменения(УзелОбмена, Выборка.Регистратор);
			//Катаев+ 08/09/14 Делаем отметку в регистре сведений, что документ был зарегистрирован в узле
			//крохин начало 31.08.2016
	//требуется придумать что-то более быстрое, пока просто убрал
			//рег = регистрыСведений.РегистрацияДокументовПоФилиалам;
			//Запрос = Новый Запрос;
			//Запрос.Текст =
			//"ВЫБРАТЬ
			//|	РегистрацияДокументовПоФилиалам.Филиал
			//|ИЗ
			//|	РегистрСведений.РегистрацияДокументовПоФилиалам КАК РегистрацияДокументовПоФилиалам
			//|ГДЕ
			//|	РегистрацияДокументовПоФилиалам.Филиал = &Филиал
			//|	И РегистрацияДокументовПоФилиалам.Документ = &Документ";
			//Запрос.УстановитьПараметр("Документ", Выборка.Регистратор);
			//Запрос.УстановитьПараметр("Филиал", УзелОбмена);
			//Если Запрос.Выполнить().Выбрать().Количество() = 0 Тогда
			//	Запись = рег.СоздатьМенеджерЗаписи();
			//	Запись.Филиал = УзелОбмена;
			//	Запись.Документ = Выборка.Регистратор;
			//	Запись.Записать();
			//КонецЕсли;
	//крохин конец 31.08.2016
			//Катаев- 08/09/14
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

Функция ПолучитьШК(сзКонтрагенты)
	сз = Новый СписокЗначений;
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Контрагенты.ШтрихКодыКонтрагента
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.Ссылка В ИЕРАРХИИ(&Контрагент)";
	Запрос.УстановитьПараметр("Контрагент", сзКонтрагенты);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Не Выборка.ШтрихКодыКонтрагента.Пустая() Тогда
			сз.Добавить(Выборка.ШтрихКодыКонтрагента);
		КонецЕсли;
	КонецЦикла;
	Возврат сз;
КонецФункции

Функция ПолучитьАртикулы(сзКонтрагенты)
	сз = Новый СписокЗначений;
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Контрагенты.ТипАртикула
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.Ссылка В ИЕРАРХИИ(&Контрагент)";
	Запрос.УстановитьПараметр("Контрагент", сзКонтрагенты);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Не Выборка.ТипАртикула.Пустая() Тогда
			сз.Добавить(Выборка.ТипАртикула);
		КонецЕсли;
	КонецЦикла;
	Возврат сз;
КонецФункции

Функция ПолучитьМатрицы(сзКонтрагенты)
	сз = Новый СписокЗначений;
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Матрица.Ссылка
	|ИЗ
	|	Документ.Матрица КАК Матрица
	|ГДЕ
	|	Матрица.ДатаОкончания >= &ТекущаяДата
	|	И Матрица.Контрагент В ИЕРАРХИИ(&Контрагент)";
	Запрос.УстановитьПараметр("ТекущаяДата", НачалоДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("Контрагент", сзКонтрагенты);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		сз.Добавить(Выборка.Ссылка);
	КонецЦикла;
	Возврат сз;
КонецФункции

Функция ПолучитьПрайсы(ТипЦен)
	сз = Новый СписокЗначений;
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПрайсЛист.Ссылка
	|ИЗ
	|	Документ.ПрайсЛист КАК ПрайсЛист
	|ГДЕ
	|	ПрайсЛист.ТипЦен В (&ТипЦен)
	|	И ПрайсЛист.Дата2 >= &ТекущаяДата";
	Запрос.УстановитьПараметр("ТипЦен", ТипЦен);
	Запрос.УстановитьПараметр("ТекущаяДата", НачалоДня(ТекущаяДата()));
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		сз.Добавить(Выборка.Ссылка);
	КонецЦикла;
	Возврат сз;
КонецФункции

Процедура ЗарегистрироватьКонтрагентов(сзКонтрагенты, сзКонтрагентыИнт, Отказ)
	Если ПолучитьПолномочиеПользователя("РедактированиеИнтегральныхКонтрагентов", ПараметрыСеанса.Пользователь) Тогда
		Отказ = Ложь;
		//Проставляем узлы в контрагенте и интегральном контрагенте
		спр = Контрагент.ПолучитьОбъект();
		ДобавитьУзлы(спр, УзелДляДобавления);
		УдалитьУзлы(спр, УзелДляУдаления);
		спр.Записать();
		//Катаев+ 22/01/14 Для случая если интегральных контрагентов несколько и они не объеденины папкой
		//спр =  КонтрагентИнт.ПолучитьОбъект();
		//ДобавитьУзлы(спр, УзелДляДобавления);
		//УдалитьУзлы(спр, УзелДляУдаления);
		//спр.Записать();
		Если КонтрагентИнт.Пустая() Тогда
			Для Каждого стр из сзКонтрагентыИнт Цикл
				спр =  стр.Значение.ПолучитьОбъект();
				ДобавитьУзлы(спр, УзелДляДобавления);
				УдалитьУзлы(спр, УзелДляУдаления);
				спр.Записать();
			КонецЦикла;
		Иначе
			спр =  КонтрагентИнт.ПолучитьОбъект();
			ДобавитьУзлы(спр, УзелДляДобавления);
			УдалитьУзлы(спр, УзелДляУдаления);
			спр.Записать();
		КонецЕсли;
		//Катаев- 22/01/14
		//Для группы производим запись элементов для автоматической регистрации в узлах
		Если Контрагент.ЭтоГруппа Тогда
			Для Каждого стр из  сзКонтрагенты Цикл
				спр = стр.Значение.ПолучитьОбъект();
				спр.Записать()
			КонецЦикла;
		КонецЕсли;
		Если КонтрагентИнт.ЭтоГруппа Тогда
			Для Каждого стр из  сзКонтрагентыИнт Цикл
				спр = стр.Значение.ПолучитьОбъект();
				спр.Записать();
			КонецЦикла;
		КонецЕсли;
	Иначе
		Сообщить("Отсутствует разрещение за запись интегрального контаргента. В проведении документа отказано. Обратитесь в ТП");
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

Функция ПолучитьТипы(сзКонтрагенты)
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Контрагенты.ТипЦен
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.Ссылка В(&сзКонтрагенты)";
	Запрос.УстановитьПараметр("сзКонтрагенты", сзКонтрагенты);
	Выборка = Запрос.Выполнить().Выбрать();
	сз = Новый СписокЗначений;
	Пока Выборка.Следующий() Цикл
		//Катаев+ 08/08/14 из типов цен исключаем еще «00. Частное лицо», «SALE Частное лицо» и группу «01. Текущие Базовые цены ОПТ» 
		Если Не Выборка.ТипЦен.Пустая() И Выборка.ТипЦен <> Справочники.ТипыЦен.НайтиПоКоду("SSP-0301") И Выборка.ТипЦен <> Справочники.ТипыЦен.НайтиПоКоду("SNL-0393") И Выборка.ТипЦен.Родитель <> Справочники.ТипыЦен.НайтиПоКоду("SSP-0236") Тогда
			сз.Добавить(Выборка.ТипЦен);
		КонецЕсли;
	КонецЦикла;
	Возврат сз;
КонецФункции

Функция ПолучитьКонтрагентов(Контрагент)
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Контрагенты.Ссылка КАК Контрагент
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.Ссылка В ИЕРАРХИИ(&Контрагент)
	|	И Контрагенты.ЭтоГруппа = ЛОЖЬ";
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Выборка = Запрос.Выполнить().Выбрать();
	сз = Новый СписокЗначений;
	Пока Выборка.Следующий() Цикл
		сз.Добавить(Выборка.Контрагент);
	КонецЦикла;
	Возврат сз;
КонецФункции
//Катаев- 20/01/14

//Катаев+ 22/01/14
Функция ПолучитьИнтКонтрагентов(Контрагент)
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Контрагенты.Ведущий.Ссылка КАК Контрагент
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.Ссылка В ИЕРАРХИИ(&Контрагент)
	|	И Контрагенты.ЭтоГруппа = ЛОЖЬ";
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Выборка = Запрос.Выполнить().Выбрать();
	сз = Новый СписокЗначений;
	Пока Выборка.Следующий() Цикл
		сз.Добавить(Выборка.Контрагент);
	КонецЦикла;
	Возврат сз;
КонецФункции
//Катаев- 22/01/14
Процедура УдалитьУзлы(спр, УзелДляУдаления)
	тз = спр.РегиональныеУзлы.Выгрузить();
	Для Каждого узел из УзелДляУдаления Цикл
		стр = тз.Найти(узел.КодУзла, "КодУзла");
		Если стр <> Неопределено Тогда
			тз.Удалить(стр);
		КонецЕсли;
	КонецЦикла;
	спр.РегиональныеУзлы.Очистить();
	спр.РегиональныеУзлы.Загрузить(тз);
	спр.Записать();
Конецпроцедуры

Процедура ДобавитьУзлы(спр, УзелДляДобавления)
	тз = спр.РегиональныеУзлы.Выгрузить();
	Для Каждого узел из УзелДляДобавления Цикл
		стр = тз.Найти(узел.КодУзла, "КодУзла");
		Если стр = Неопределено Тогда
			стр = тз.Добавить();
			стр.КодУзла = узел.КодУзла;
		КонецЕсли;
	КонецЦикла;
	спр.РегиональныеУзлы.Очистить();
	спр.РегиональныеУзлы.Загрузить(тз);
	спр.Записать();
Конецпроцедуры
